
## Plan Result (aat)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to import, 6 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * module.postgresql_v15_replica[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.postgresql_v15_replica[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.postgresql_v15_replica[0].azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;azure.extensions&#34;]
  * module.postgresql_v15_replica[0].azurerm_postgresql_flexible_server_database.pg_databases[&#34;hmc_cft_hearing_service&#34;]
  * module.postgresql_v15_replica[0].null_resource.set-user-permissions-additionaldbs[&#34;hmc_cft_hearing_service&#34;]
* Replace
  * module.postgresql_v15_replica[0].azurerm_postgresql_flexible_server.pgsql_server


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.postgresql_v15_replica[0].azurerm_postgresql_flexible_server.pgsql_server must be replaced
  # (imported from "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-cft-hearing-service-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/hmc-cft-hearing-service-postgres-db-v15-aat")
  # Warning: this will destroy the imported resource
-/+ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
        administrator_login           = "pgadmin"
      + administrator_password        = (sensitive value)
        auto_grow_enabled             = false
        backup_retention_days         = 35
      + create_mode                   = "Replica" # forces replacement
        delegated_subnet_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/postgres-expanded"
      ~ fqdn                          = "hmc-cft-hearing-service-postgres-db-v15-aat.postgres.database.azure.com" -> (known after apply)
        geo_redundant_backup_enabled  = false
      ~ id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-cft-hearing-service-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/hmc-cft-hearing-service-postgres-db-v15-aat" -> (known after apply)
        location                      = "uksouth"
        name                          = "hmc-cft-hearing-service-postgres-db-v15-aat"
        private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com"
      ~ public_network_access_enabled = false -> (known after apply)
        replication_role              = null
        resource_group_name           = "hmc-cft-hearing-service-postgres-db-v15-data-aat"
        sku_name                      = "GP_Standard_D2s_v3"
      + source_server_id              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-cft-hearing-service-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/hmc-cft-hearing-service-postgres-db-v15-aat" # forces replacement
        storage_mb                    = 65536
      ~ storage_tier                  = "P6" -> (known after apply)
        tags                          = {
            "application"         = "core-case-data"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/hmc-cft-hearing-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#ccd_support"
            "environment"         = "staging"
            "managedBy"           = "CDM"
        }
        version                       = "15"
      - zone                          = "2" -> null

        authentication {
            active_directory_auth_enabled = true
            password_auth_enabled         = true
            tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
        }

      ~ high_availability {
            mode                      = "ZoneRedundant"
          - standby_availability_zone = "1" -> null
        }

        maintenance_window {
            day_of_week  = 0
            start_hour   = 3
            start_minute = 0
        }
    }

  # module.postgresql_v15_replica[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_name      = "DTS Platform Operations"
      + principal_type      = "Group"
      + resource_group_name = "hmc-cft-hearing-service-postgres-db-v15-data-aat"
      + server_name         = "hmc-cft-hearing-service-postgres-db-v15-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql_v15_replica[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      + id                  = (known after apply)
      + object_id           = "ca6d5085-485a-417d-8480-c3cefa29df31"
      + principal_name      = "jenkins-cftptl-intsvc-mi"
      + principal_type      = "ServicePrincipal"
      + resource_group_name = "hmc-cft-hearing-service-postgres-db-v15-data-aat"
      + server_name         = "hmc-cft-hearing-service-postgres-db-v15-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql_v15_replica[0].azurerm_postgresql_flexible_server_configuration.pgsql_server_config["azure.extensions"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "azure.extensions"
      + server_id = (known after apply)
      + value     = "plpgsql,pg_stat_statements,pg_buffercache,hypopg"
    }

  # module.postgresql_v15_replica[0].azurerm_postgresql_flexible_server_database.pg_databases["hmc_cft_hearing_service"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "hmc_cft_hearing_service"
      + server_id = (known after apply)
    }

  # module.postgresql_v15_replica[0].null_resource.set-user-permissions-additionaldbs["hmc_cft_hearing_service"] will be created
  + resource "null_resource" "set-user-permissions-additionaldbs" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS CFT DB Access Reader"
          + "force_trigger"  = null
          + "name"           = "hmc-cft-hearing-service-postgres-db-v15"
          + "script_hash"    = "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc"
        }
    }

Plan: 1 to import, 6 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":483,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->